old-tests/getnet/services/payments/boleto/cassettes/PaymentBoletoIntegrationTest.testCreate.yaml

interactions:
- request:
    body: scope=oob&grant_type=client_credentials
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic Y2RmOGI0MWItY2QwZi00MzFmLWJhMmQtYzZjY2RlMTcyMzYwOjhiMjFhZjU2LTA5NWEtNGRhNS04YTU3LTMyMDI5MTU2YThiNw==
      Connection:
      - keep-alive
      Content-Length:
      - '39'
      Content-Type:
      - application/x-www-form-urlencoded
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/auth/oauth/v2/token
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAKvm5VJQUEpMTk4tLo4vyc9OzVOyUjJPSTM1MkpL1U0yMzPUNbFINtFNNE021TU2
        S0oxNzczNDQxSFLSAesEa4kvqSxIBepzSk0sSi2CyqRWFGQWpRbHZwJNNDYzMICIFifng5Xm5ycp
        8XLVAgA1wIVMfwAAAA==
    headers:
      Cache-Control:
      - no-store
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Length:
      - '127'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Tue, 12 Nov 2019 23:48:09 GMT
      Pragma:
      - no-cache
      Server:
      - Apache-Coyote/1.1
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '14'
      X-EdgeConnect-Origin-MEX-Latency:
      - '54'
      X-Powered-By:
      - '50064'
      preload:
      - ''
    status:
      code: 200
      message: OK
- request:
    body: scope=oob&grant_type=client_credentials
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic Y2RmOGI0MWItY2QwZi00MzFmLWJhMmQtYzZjY2RlMTcyMzYwOjhiMjFhZjU2LTA5NWEtNGRhNS04YTU3LTMyMDI5MTU2YThiNw==
      Connection:
      - keep-alive
      Content-Length:
      - '39'
      Content-Type:
      - application/x-www-form-urlencoded
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/auth/oauth/v2/token
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAC3MQQqDMBQE0L3gHeSvG/gkRqPLXiSk6QSkYCTJQineXUm7nZk337bpOnLeI2db
        4gcrzSRDYEhjBPQwiV6/nTAjKzEqaVh77oNkelRZiS3Hhts94RLSv8G+LQnZLvejGph/afaxTmN8
        UducF7f4I3l/AAAA
    headers:
      Cache-Control:
      - no-store
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Length:
      - '126'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Tue, 12 Nov 2019 23:48:09 GMT
      Pragma:
      - no-cache
      Server:
      - Apache-Coyote/1.1
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '7'
      X-EdgeConnect-Origin-MEX-Latency:
      - '55'
      X-Powered-By:
      - '50064'
      preload:
      - ''
    status:
      code: 200
      message: OK
- request:
    body: '{"seller_id": "eb523ac0-10e0-4acd-96b4-24436227e5b1", "amount": 1000, "currency":
      "BRL", "order": {"order_id": "6d2e4380-d8a3-4ccb-9138-c289182818a3", "sales_tax":
      0, "product_type": "physical_goods"}, "boleto": {"our_number": null, "document_number":
      "44181342000120", "expiration_date": "16/11/2019", "instructions": "N\u00e3o
      receber ap\u00f3s o vencimento", "provider": "santander"}, "customer": {"customer_id":
      "customer_21081826", "first_name": "Jo\u00e3o", "last_name": "da Silva", "document_type":
      "CPF", "document_number": "78075751159", "phone_number": "5551999887766", "email":
      "customer@email.com.br", "name": "Jo\u00e3o da Silva", "billing_address": {"street":
      "Av. Brasil", "number": "1000", "complement": "Sala 1", "district": "S\u00e3o
      Geraldo", "city": "Porto Alegre", "state": "RS", "country": "Brasil", "postal_code":
      "90230060"}}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer 2ff0e288-e569-45da-8703-732805c04f20
      Connection:
      - keep-alive
      Content-Length:
      - '850'
      Content-Type:
      - application/json
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/v1/payments/boleto
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAJ2S24rbMBCGX8XoOopn5PEpd10alsIeyrJ3pRidwpp17CDbpSHk3VeynU1a6E0t
        jMw//3yekebEDvK4t+1Q1YZtWGq0IlLS7CyWBICYA6m8ZCvW26axbrZZlYpEauAIFjhJbXiZKeKC
        KMmEyG2q0KfIfTe2A9sgAKyYHp2zrT76/LuXBx/unLkAMyMsJQVwU8iEk9aKl5gUXIuixEIU6OVQ
        wyCHsWebiH3fPn399nTvNdU1dujY5rR8zUAEYdBQypFsxgmV5CpD5KEfKjKJWRmaUrJ9926A5Iqv
        dGdsQFyVRirbeGn7GH252768PvvQcDzY3dhUTd0GtyeU5VrkaQoRiBRgDeHBaNrWCH5RRFEBeQpz
        yL9TCe7yx8CgPw3lRBSLctH98pl134+2MnKYqhUxYiwAQ1v296F2cqi79jOc3YS70VXtuFfWTb3f
        kH3QdHqcBuLqIMICExLBIULNoel3fw8/TuzN2Z33xL8wXiapj+eLiP81TPHB7DzETUe6XNoshTP1
        2v32lZ1X/8d+G/bN3/BFu6X/PJ8/AKtNhK/7AgAA
    headers:
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Length:
      - '429'
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Tue, 12 Nov 2019 23:48:10 GMT
      Server:
      - Apache-Coyote/1.1
      Set-Cookie:
      - d10a87f6cf32b4f157ed6c771a5241a8=752492cadba61260f97becd57331d5fb; Path=/v1/payments;
        HttpOnly; Secure; Domain=api-homologacao.getnet.com.br
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '14'
      X-EdgeConnect-Origin-MEX-Latency:
      - '1039'
      X-Powered-By:
      - '50064'
      preload:
      - ''
    status:
      code: 201
      message: Created
version: 1
