old-tests/getnet/services/payments/boleto/cassettes/PaymentBoletoIntegrationTest.testInvalidCreate.yaml

interactions:
- request:
    body: scope=oob&grant_type=client_credentials
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic Y2RmOGI0MWItY2QwZi00MzFmLWJhMmQtYzZjY2RlMTcyMzYwOjhiMjFhZjU2LTA5NWEtNGRhNS04YTU3LTMyMDI5MTU2YThiNw==
      Connection:
      - keep-alive
      Content-Length:
      - '39'
      Content-Type:
      - application/x-www-form-urlencoded
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/auth/oauth/v2/token
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAC3MQQqDMBQE0L3gHeSvDST1x6QuvUiIYQQpNCFx0VK8u5K6nZk3v7bpOvIhoBS3
        xxfeNJF8sPVspFi8CoLVqoXVgxHA04wrs1Ea1FdZidu/CZeb4TPy3eCTtozitutxGKX8pyXEOo1x
        obY5ThbHCyN/AAAA
    headers:
      Cache-Control:
      - no-store
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Length:
      - '126'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Tue, 12 Nov 2019 23:51:22 GMT
      Pragma:
      - no-cache
      Server:
      - Apache-Coyote/1.1
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '2'
      X-EdgeConnect-Origin-MEX-Latency:
      - '55'
      X-Powered-By:
      - '50125'
      preload:
      - ''
    status:
      code: 200
      message: OK
- request:
    body: scope=oob&grant_type=client_credentials
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Basic Y2RmOGI0MWItY2QwZi00MzFmLWJhMmQtYzZjY2RlMTcyMzYwOjhiMjFhZjU2LTA5NWEtNGRhNS04YTU3LTMyMDI5MTU2YThiNw==
      Connection:
      - keep-alive
      Content-Length:
      - '39'
      Content-Type:
      - application/x-www-form-urlencoded
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/auth/oauth/v2/token
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAKvm5VJQUEpMTk4tLo4vyc9OzVOyUkpNtjBJTEtL0TU3T0vUNTFPStRNMrcw1zUx
        TEkzMkizSDZLtVTSAesEa4kvqSxIBepzSk0sSi2CyqRWFGQWpRbHZwJNNDYzMICIFifng5Xm5ycp
        8XLVAgD+UB/EfwAAAA==
    headers:
      Cache-Control:
      - no-store
      Connection:
      - keep-alive
      Content-Encoding:
      - gzip
      Content-Length:
      - '127'
      Content-Type:
      - application/json;charset=UTF-8
      Date:
      - Tue, 12 Nov 2019 23:51:22 GMT
      Pragma:
      - no-cache
      Server:
      - Apache-Coyote/1.1
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '8'
      X-EdgeConnect-Origin-MEX-Latency:
      - '46'
      X-Powered-By:
      - '50125'
      preload:
      - ''
    status:
      code: 200
      message: OK
- request:
    body: '{"seller_id": "eb523ac0-10e0-4acd-96b4-24436227e5b1", "amount": 1000, "currency":
      "BRL", "order": {"order_id": "6d2e4380-d8a3-4ccb-9138-c289182818a3", "sales_tax":
      0, "product_type": "physical_goods"}, "boleto": {"our_number": null, "document_number":
      "44181342000120", "expiration_date": "16/11/2010", "instructions": "N\u00e3o
      receber ap\u00f3s o vencimento", "provider": "santander"}, "customer": {"customer_id":
      "customer_21081826", "first_name": "Jo\u00e3o", "last_name": "da Silva", "document_type":
      "CPF", "document_number": "78075751159", "phone_number": "5551999887766", "email":
      "customer@email.com.br", "name": "Jo\u00e3o da Silva", "billing_address": {"street":
      "Av. Brasil", "number": "1000", "complement": "Sala 1", "district": "S\u00e3o
      Geraldo", "city": "Porto Alegre", "state": "RS", "country": "Brasil", "postal_code":
      "90230060"}}}'
    headers:
      Accept:
      - '*/*'
      Accept-Encoding:
      - gzip, deflate
      Authorization:
      - Bearer ec84affd-77fa-47ba-b787-41df20f8c6e9
      Connection:
      - keep-alive
      Content-Length:
      - '850'
      Content-Type:
      - application/json
      seller_id:
      - eb523ac0-10e0-4acd-96b4-24436227e5b1
      user-agent:
      - getnet-py/1.0
    method: POST
    uri: https://api-homologacao.getnet.com.br/v1/payments/boleto
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAAJ2QwWrDMAyGX0X43G7OSAntzSw+5JBka7qVMUawY60YkjhY3qCUvvvcNpdedxP8
        +n596MQoqPBDbecMsk3KnxZsVEMc2RYPlgL6SR0HHAM9atdjcOh/bYdswQYkUofLJucJ58tc7ATI
        smgaUUMpinoLr28SBFyDd1k9F6WsdnVEDQZle2Kbz9N8P7bksipkHlP03vlZiL2IjwvVLKPalaTO
        2ylYN8ZwrwhGF2ByRFb3CMGBn7XhpvtwD7W30/+Rnv/QWhPplel0usq0+cZkncauJOOpzpCdv85/
        e4EHsVQBAAA=
    headers:
      Connection:
      - close
      Content-Encoding:
      - gzip
      Content-Length:
      - '236'
      Content-Type:
      - application/json;charset=utf-8
      Date:
      - Tue, 12 Nov 2019 23:51:23 GMT
      Server:
      - Apache-Coyote/1.1
      Set-Cookie:
      - d10a87f6cf32b4f157ed6c771a5241a8=752492cadba61260f97becd57331d5fb; Path=/v1/payments;
        HttpOnly; Secure; Domain=api-homologacao.getnet.com.br
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains
      Vary:
      - Accept-Encoding
      X-EdgeConnect-MidMile-RTT:
      - '8'
      X-EdgeConnect-Origin-MEX-Latency:
      - '901'
      X-Powered-By:
      - '50125'
      preload:
      - ''
    status:
      code: 402
      message: Payment Required
version: 1
